hybridFlu/examples/case_foam2vtk/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/cliffoi/OpenFOAM/cliffoi-1.4.1-dev/run/vtkInterfaceFoam";
    case "cavity";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
movingWall
{
    type wall;
    physicalType wall;
    nFaces 20;
    startFace 760;
}

fixedWalls
{
    type wall;
    physicalType wall;
    nFaces 60;
    startFace 780;
}

frontAndBack
{
    type empty;
    physicalType empty;
    nFaces 800;
    startFace 840;
}
)

// ************************************************************************* //
